In [1]:
import pandas as pd
import numpy as np

In [84]:
data={'name': ["harsh", "N/A",'varun','N/A' , 'N/A'] , 'age' :[22,21,"?",45,32]}

In [85]:
df=pd.DataFrame(data)

In [86]:
df

    name age
0  harsh  22
1    N/A  21
2  varun   ?
3    N/A  45
4    N/A  32

In [87]:
a=df.where(df!='N/A',  np.nan)

In [88]:
c=a.where(df!='?',  np.nan)

In [89]:
c

    name  age
0  harsh   22
1    NaN   21
2  varun  NaN
3    NaN   45
4    NaN   32

In [90]:
drop_col=c.isnull().sum() *100/len(c)

In [91]:
drop_col

name    60.0
age     20.0
dtype: float64

In [109]:
to_drop = drop_col[drop_col>50].index
to_drop

Index(['name'], dtype='object')

In [96]:
d=c.drop(columns=to_drop)

In [97]:
mean_value= d['age'].mean()

In [98]:
d.fillna(mean_value)

    age
0  22.0
1  21.0
2  30.0
3  45.0
4  32.0

In [240]:
data = {'col1': [1, 2, 'N/A', 4, 5, '?', 7, 8, np.nan, 10],
        'col2': ['A', 'B', 'C', 'N/A', 'E', 'F', '?', 'H', 'I', 'J'],
        'col3': [100, 200, 300, 400, 500, '?', 700, 'N/A', 900, 1000],
        'col4': [np.nan, np.nan, np.nan, np.nan, 5, 6, 7, 8, 9, 10], # >50% nulls
        'col5': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', np.nan],
        'col6': [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan] # All nulls
       }
df = pd.DataFrame(data)

In [241]:
df

  col1 col2  col3  col4 col5  col6
0    1    A   100   NaN    X   NaN
1    2    B   200   NaN    Y   NaN
2  N/A    C   300   NaN    Z   NaN
3    4  N/A   400   NaN    X   NaN
4    5    E   500   5.0    Y   NaN
5    ?    F     ?   6.0    Z   NaN
6    7    ?   700   7.0    X   NaN
7    8    H   N/A   8.0    Y   NaN
8  NaN    I   900   9.0    Z   NaN
9   10    J  1000  10.0  NaN   NaN

In [242]:
a=df.replace(["N/A", "?"] , np.nan)

In [243]:
to_drop= a.isnull().sum() * 100/len(df)

In [244]:
to_drop

col1     30.0
col2     20.0
col3     20.0
col4     40.0
col5     10.0
col6    100.0
dtype: float64

In [245]:
more50 = to_drop[to_drop>50].index

In [246]:
more50

Index(['col6'], dtype='object')

In [248]:
a.drop(columns=more50)

   col1 col2    col3  col4 col5
0   1.0    A   100.0   NaN    X
1   2.0    B   200.0   NaN    Y
2   NaN    C   300.0   NaN    Z
3   4.0  NaN   400.0   NaN    X
4   5.0    E   500.0   5.0    Y
5   NaN    F     NaN   6.0    Z
6   7.0  NaN   700.0   7.0    X
7   8.0    H     NaN   8.0    Y
8   NaN    I   900.0   9.0    Z
9  10.0    J  1000.0  10.0  NaN

In [249]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    7 non-null      float64
 1   col2    8 non-null      object
 2   col3    8 non-null      float64
 3   col4    6 non-null      float64
 4   col5    9 non-null      object
 5   col6    0 non-null      float64
dtypes: float64(4), object(2)
memory usage: 608.0+ bytes

In [258]:
for col in df.columns:
    df[col] = pd.to_numeric(df[col], errors='coerce')

In [259]:
for col in df.select_dtypes(include='object').columns:
    df[col] = df[col].astype('category')

In [260]:
numeric_cols = df.select_dtypes(include=np.number).columns
categorical_cols = df.select_dtypes(include='category').columns

In [261]:
df[numeric_cols] = df[numeric_cols].fillna(df[numeric_cols].mean())

In [262]:
for col in categorical_cols:
    df[col].fillna(df[col].mode() [0], inplace=True)
    print(f"Filled NaNs in categorical column '{col}' with mode: {df[col].mode() [0]}")

In [263]:
df

        col1  col2    col3  col4  col5  col6
0   1.000000   NaN   100.0   7.5   NaN   NaN
1   2.000000   NaN   200.0   7.5   NaN   NaN
2   5.285714   NaN   300.0   7.5   NaN   NaN
3   4.000000   NaN   400.0   7.5   NaN   NaN
4   5.000000   NaN   500.0   5.0   NaN   NaN
5   5.285714   NaN   512.5   6.0   NaN   NaN
6   7.000000   NaN   700.0   7.0   NaN   NaN
7   8.000000   NaN   512.5   8.0   NaN   NaN
8   5.285714   NaN   900.0   9.0   NaN   NaN
9  10.000000   NaN  1000.0  10.0   NaN   NaN